---
kind: method
id: M:Autodesk.Revit.UI.FileDialog.Dispose
source: html/9b5a81a9-6a5f-2735-d4ef-5b56e2722315.htm
---
# Autodesk.Revit.UI.FileDialog.Dispose Method

Releases all resources used by the FileDialog

## Syntax (C#)
```csharp
public void Dispose()
```